---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.ForceRegenSketch
source: html/82fe5634-18f9-b315-9f1b-7e2843792cd3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.ForceRegenSketch Property

Regen Sketch

## Syntax (C#)
```csharp
public static FailureDefinitionId ForceRegenSketch { get; }
```